OpenFOAM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"
//     momErr
//     {
//         type            momentumError;
//         libs            (fieldFunctionObjects);
//         executeControl  writeTime;
//         writeControl    writeTime;
//     }
// 
//     contErr
//     {
//         type            div;
//         libs            (fieldFunctionObjects);
//         field           phi;
//         executeControl  writeTime;
//         writeControl    writeTime;
//     }
// 
// 
//     turbulenceFields1
//     {
//         type            turbulenceFields;
//         libs            (fieldFunctionObjects);
//         fields
//         (
//             k
//             epsilon
//             nut
//             nuEff
//             R
//             devReff
//             L
//             I
//         );
// 
//         executeControl  writeTime;
//         writeControl    writeTime;
//     }
// 
//     mag1
//     {
//         type            mag;
//         libs            (fieldFunctionObjects);
//         field           turbulenceProperties:R;
// 
//         result          magR;
//         executeControl  writeTime;
//         writeControl    writeTime;
//     }
}


// ************************************************************************* //
